Revit 2027 API
Color.Red Property
Get the red channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public byte Red { get; set; }
Public Property Red As Byte
	Get
	Set
public:
property unsigned char Red {
	unsigned char get ();
	void set (unsigned char value);
}
member Red : byte with get, set
Property Value
Byte
Exceptions
Exception | Condition
InvalidOperationException | When getting the value: the color is invalid or uninitialized.
See Also
Reference
Color Class
Autodesk.Revit.DB Namespace